apache/nuttx/arch/arm/src/tms570/tms570_serial.c
/****************************************************************************
 * arch/arm/src/tms570/tms570_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "hardware/tms570_sci.h"
#include "tms570_lowputc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef USE_SERIALDRIVER

/* Which SCI with be tty0/console and which tty1? */

/* First pick the console and ttys0.  This could be any of SCI1-1 */

#if defined(CONFIG_SCI1_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_sci1port  /* SCI1 is console */
#    define TTYS0_DEV           g_sci1port  /* SCI1 is ttyS0 */
#    define SCI1_ASSIGNED       1
#elif defined(CONFIG_SCI2_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_sci2port  /* SCI2 is console */
#    define TTYS0_DEV           g_sci2port  /* SCI2 is ttyS0 */
#    define SCI2_ASSIGNED       1
#else
#  undef CONSOLE_DEV                        /* No console */
#  if defined(CONFIG_TMS570_SCI1)
#    define TTYS0_DEV           g_sci1port  /* SCI1 is ttyS0 */
#    define SCI1_ASSIGNED       1
#  elif defined(CONFIG_TMS570_SCI2)
#    define TTYS0_DEV           g_sci2port  /* SCI2 is ttyS0 */
#    define SCI2_ASSIGNED       1
#  endif
#endif

/* Pick ttys1.  This could be any of SCI1-1, excluding the console
 * SCI.
 */

#if defined(CONFIG_TMS570_SCI1) && !defined(SCI1_ASSIGNED)
#  define TTYS1_DEV             g_sci1port  /* SCI1 is ttyS1 */
#  define SCI1_ASSIGNED         1
#elif defined(CONFIG_TMS570_SCI2) && !defined(SCI2_ASSIGNED)
#  define TTYS1_DEV             g_sci2port  /* SCI2 is ttyS1 */
#  define SCI2_ASSIGNED         1
#endif

/* BAUD definitions
 *
 * The source clock is selectable and could be one of:
 *
 *   - The peripheral clock
 *   - A division of the peripheral clock, where the divider is product-
 *     dependent, but generally set to 8
 *   - A processor/peripheral independent clock source fully programmable
 *      provided by PMC (PCK)
 *   - The external clock, available on the SCK pin
 *
 * Only the first two options are supported by this driver.  The divided
 * peripheral clock is only used for very low BAUD selections.
 */

#define FAST_SCI_CLOCK         BOARD_MCK_FREQUENCY
#define SLOW_SCI_CLOCK         (BOARD_MCK_FREQUENCY >> 3)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct tms570_dev_s
{
  const uint32_t scibase;       /* Base address of SCI registers */
  struct sci_config_s config;   /* SCI configuration */
  uint8_t irq;                  /* IRQ associated with this SCI */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  tms570_setup(struct uart_dev_s *dev);
static void tms570_shutdown(struct uart_dev_s *dev);
static int  tms570_attach(struct uart_dev_s *dev);
static void tms570_detach(struct uart_dev_s *dev);
static int  tms570_interrupt(int irq, void *context, void *arg);
static int  tms570_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  tms570_receive(struct uart_dev_s *dev, unsigned int *status);
static void tms570_rxint(struct uart_dev_s *dev, bool enable);
static bool tms570_rxavailable(struct uart_dev_s *dev);
static void tms570_send(struct uart_dev_s *dev, int ch);
static void tms570_txint(struct uart_dev_s *dev, bool enable);
static bool tms570_txready(struct uart_dev_s *dev);
static bool tms570_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_sci_ops =
{
  .setup          = tms570_setup,
  .shutdown       = tms570_shutdown,
  .attach         = tms570_attach,
  .detach         = tms570_detach,
  .ioctl          = tms570_ioctl,
  .receive        = tms570_receive,
  .rxint          = tms570_rxint,
  .rxavailable    = tms570_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = tms570_send,
  .txint          = tms570_txint,
  .txready        = tms570_txready,
  .txempty        = tms570_txempty,
};

/* I/O buffers */

#ifdef CONFIG_TMS570_SCI1
static char g_sci1rxbuffer[CONFIG_SCI1_RXBUFSIZE];
static char g_sci1txbuffer[CONFIG_SCI1_TXBUFSIZE];
#endif
#ifdef CONFIG_TMS570_SCI2
static char g_sci2rxbuffer[CONFIG_SCI2_RXBUFSIZE];
static char g_sci2txbuffer[CONFIG_SCI2_TXBUFSIZE];
#endif

