apache/nuttx/arch/arm/src/tms570/tms570_serial.c
/* This describes the state of the SCI1 port. */

#ifdef CONFIG_TMS570_SCI1
static struct tms570_dev_s g_sci1priv =
{
  .scibase        = TMS570_SCI1_BASE,
  .config         =
  {
    .baud         = CONFIG_SCI1_BAUD,
    .parity       = CONFIG_SCI1_PARITY,
    .bits         = CONFIG_SCI1_BITS,
    .stopbits2    = CONFIG_SCI1_2STOP,
  },
  .irq            = TMS570_REQ_SCI1_0,
};

static uart_dev_t g_sci1port =
{
  .recv     =
  {
    .size   = CONFIG_SCI1_RXBUFSIZE,
    .buffer = g_sci1rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_SCI1_TXBUFSIZE,
    .buffer = g_sci1txbuffer,
  },
  .ops      = &g_sci_ops,
  .priv     = &g_sci1priv,
};
#endif

/* This describes the state of the SCI2 port. */

#ifdef CONFIG_TMS570_SCI2
static struct tms570_dev_s g_sci2priv =
{
  .scibase        = TMS570_SCI2_BASE,
  .config         =
  {
    .baud         = CONFIG_SCI2_BAUD,
    .parity       = CONFIG_SCI2_PARITY,
    .bits         = CONFIG_SCI2_BITS,
    .stopbits2    = CONFIG_SCI2_2STOP,
  },
  .irq            = TMS570_REQ_SCI2_0,
};

static uart_dev_t g_sci2port =
{
  .recv     =
  {
    .size   = CONFIG_SCI2_RXBUFSIZE,
    .buffer = g_sci2rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_SCI2_TXBUFSIZE,
    .buffer = g_sci2txbuffer,
  },
  .ops      = &g_sci_ops,
  .priv     = &g_sci2priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tms570_serialin
 ****************************************************************************/

static inline uint32_t tms570_serialin(struct tms570_dev_s *priv, int offset)
{
  return getreg32(priv->scibase + offset);
}

/****************************************************************************
 * Name: tms570_serialout
 ****************************************************************************/

static inline void tms570_serialout(struct tms570_dev_s *priv, int offset,
                                    uint32_t value)
{
  putreg32(value, priv->scibase + offset);
}

/****************************************************************************
 * Name: tms570_restoresciint
 ****************************************************************************/

static inline void tms570_restoresciint(struct tms570_dev_s *priv,
                                        uint32_t ints)
{
  /* Restore the previous interrupt state (assuming all interrupts
   * disabled)
   */

  tms570_serialout(priv, TMS570_SCI_SETINT_OFFSET, ints);
}

/****************************************************************************
 * Name: tms570_disableallints
 ****************************************************************************/

static void tms570_disableallints(struct tms570_dev_s *priv, uint32_t *ints)
{
  irqstate_t flags;

  /* The following must be atomic */

  flags = enter_critical_section();
  if (ints)
    {
      /* Return the current enable bitsopop9 */

      *ints = tms570_serialin(priv, TMS570_SCI_SETINT_OFFSET);
    }

  /* Disable all interrupts */

  tms570_serialout(priv, TMS570_SCI_CLEARINT_OFFSET, SCI_INT_ALLINTS);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: tms570_setup
 *
 * Description:
 *   Configure the SCI baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int tms570_setup(struct uart_dev_s *dev)
{
#ifndef CONFIG_SUPPRESS_SCI_CONFIG
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;

  /* Configure baud, number of bits, stop bits, and parity */

  return tms570_sci_configure(priv->scibase, &priv->config);
#else
  return OK;
#endif
}

/****************************************************************************
 * Name: tms570_shutdown
 *
 * Description:
 *   Disable the SCI.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void tms570_shutdown(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;

  /* Reset and disable receiver and transmitter */

  tms570_serialout(priv, TMS570_SCI_GCR1_OFFSET, 0);

  /* Disable all interrupts */

  tms570_disableallints(priv, NULL);
}

/****************************************************************************
 * Name: tms570_attach
 *
 * Description:
 *   Configure the SCI to operation in interrupt driven mode.  This method is
 *   called when the serial port is opened.  Normally, this is just after the
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int tms570_attach(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, tms570_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the SCI
       */

      up_enable_irq(priv->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: tms570_detach
 *
 * Description:
 *   Detach SCI interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

