apache/nuttx/arch/arm/src/tms570/tms570_serial.c
static void tms570_detach(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: tms570_interrupt
 *
 * Description:
 *   This is the common SCI interrupt handler.  It will be invoked
 *   when an interrupt received on the device.  It should call
 *   sci_transmitchars or sci_receivechar to perform the appropriate data
 *   transfers.
 *
 ****************************************************************************/

static int tms570_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct tms570_dev_s *priv;
  uint32_t intvec;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  priv = (struct tms570_dev_s *)dev->priv;

  /* Loop until there are no further pending interrupts */

  for (; ; )
    {
      /* Get the next pending interrupt.  For most interrupts, reading the
       * INVECT0 register clears the corresponding INTFLAG.
       */

      intvec = tms570_serialin(priv, TMS570_SCI_INTVECT0_OFFSET) & \
               SCI_INTVECT_MASK;

      /* Handle the pending interrupt */

      switch (intvec)
        {
          case SCI_INTVECT_NONE:    /* No interrupt */
            return OK;

          case SCI_INTVECT_WAKEUP:  /* Wake-up interrupt */

            /* SCI sets the WAKEUP flag if bus activity on the RX line
             * either prevents power-down mode from being entered, or RX
             * line activity causes an exit from power-down mode. If
             * enabled wakeup interrupt is triggered once WAKEUP flag is
             * set.
             *
             * REVISIT: This interrupt is ignored because for now the
             * break detect interrupt is never enabled.
             */

            break;

          /* SCI Errors
           *
           * REVISIT: These error interrupta are ignored because for now the
           * break detect interrupt is never enabled.
           */

          case SCI_INTVECT_PE:      /* Parity error interrupt */
          case SCI_INTVECT_FE:      /* Framing error interrupt */
          case SCI_INTVECT_OE:      /* Overrun error interrupt */
          case SCI_INTVECT_BRKDT:   /* Break detect interrupt */
          case SCI_INTVECT_BE:      /* Bit error interrupt */
            break;

          case SCI_INTVECT_RX:      /* Receive interrupt */
            {
              /* Receive data ready... process incoming bytes */

              uart_recvchars(dev);
            }
            break;

          case SCI_INTVECT_TX:      /* Transmit interrupt */
            {
              /* Transmit data register available ...
               * process outgoing bytes
               */

              uart_xmitchars(dev);
            }
            break;

          /* LIN mode only.  These should never occur in SCI mode */

          case SCI_INTVECT_ISFE:    /* Inconsistent synch field error interrupt */
          case SCI_INTVECT_ID:      /* Identification interrupt */
          case SCI_INTVECT_PBE:     /* Physical bus error interrupt */
          case SCI_INTVECT_CE:      /* Checksum error interrupt */
          case SCI_INTVECT_NRE:     /* No response error interrupt */
          case SCI_INTVECT_TOAWUS:  /* Timeout after wakeup signal interrupt */
          case SCI_INTVECT_TOA3WUS: /* Timeout after 2 Wakeup signls interrupt */
          case SCI_INTVECT_TIMEOUT: /* Timeout interrupt */

          default:
            DEBUGPANIC();
        }
    }

  return OK;
}

/****************************************************************************
 * Name: tms570_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int tms570_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
  int                ret   = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
         struct tms570_dev_s *user = (struct tms570_dev_s *)arg;
         if (!user)
           {
             ret = -EINVAL;
           }
         else
           {
             memcpy(user, dev, sizeof(struct tms570_dev_s));
           }
       }
       break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios  *termiosp = (struct termios *)arg;
        struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Return parity */

        termiosp->c_cflag = ((priv->config.parity != 0) ? PARENB : 0) |
                            ((priv->config.parity == 1) ? PARODD : 0);

        /* Return stop bits */

        termiosp->c_cflag |= (priv->config.stopbits2) ? CSTOPB : 0;

        /* Return baud */

        cfsetispeed(termiosp, priv->config.baud);

        /* Return number of bits */

        switch (priv->config.bits)
          {
          case 5:
            termiosp->c_cflag |= CS5;
            break;

          case 6:
            termiosp->c_cflag |= CS6;
            break;

          case 7:
            termiosp->c_cflag |= CS7;
            break;

          default:
          case 8:
            termiosp->c_cflag |= CS8;
            break;

          case 9:
            termiosp->c_cflag |= CS8 /* CS9 */;
            break;
          }
      }
      break;

    case TCSETS:
      {
        struct termios  *termiosp = (struct termios *)arg;
        struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
        uint32_t baud;
        uint32_t ints;
        uint8_t parity;
        uint8_t nbits;
        bool stop2;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Decode baud. */

        ret = OK;
        baud = cfgetispeed(termiosp);

        /* Decode number of bits */

        switch (termiosp->c_cflag & CSIZE)
          {
          case CS5:
            nbits = 5;
            break;

