apache/nuttx/arch/arm/src/tms570/tms570_serial.c
          case CS6:
            nbits = 6;
            break;

          case CS7:
            nbits = 7;
            break;

          case CS8:
            nbits = 8;
            break;
#if 0
          case CS9:
            nbits = 9;
            break;
#endif
          default:
            ret = -EINVAL;
            break;
          }

        /* Decode parity */

        if ((termiosp->c_cflag & PARENB) != 0)
          {
            parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            parity = 0;
          }

        /* Decode stop bits */

        stop2 = (termiosp->c_cflag & CSTOPB) != 0;

        /* Verify that all settings are valid before committing */

        if (ret == OK)
          {
            /* Commit */

            priv->config.baud      = baud;
            priv->config.parity    = parity;
            priv->config.bits      = nbits;
            priv->config.stopbits2 = stop2;

            /* effect the changes immediately - note that we do not
             * implement TCSADRAIN / TCSAFLUSH
             */

            tms570_disableallints(priv, &ints);
            ret = tms570_sci_configure(priv->scibase, &priv->config);

            /* Restore the interrupt state */

            tms570_restoresciint(priv, ints);
          }
      }
      break;
#endif /* CONFIG_SERIAL_TERMIOS */

    default:
      ret = -ENOTTY;
      break;
    }

  return ret;
}

/****************************************************************************
 * Name: tms570_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the SCI.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

static int tms570_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;

  /* Return the error information in the saved status. */

  *status = tms570_serialin(priv, TMS570_SCI_FLR_OFFSET);

  /* Then return the actual received byte */

  return (int)(tms570_serialin(priv, TMS570_SCI_RD_OFFSET) & 0xff);
}

/****************************************************************************
 * Name: tms570_rxint
 *
 * Description:
 *   Call to enable or disable RXRDY interrupts
 *
 ****************************************************************************/

static void tms570_rxint(struct uart_dev_s *dev, bool enable)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;

  if (enable)
    {
      /* Receive an interrupt when their is anything in the Rx data register
       * (or an RX timeout occurs).
       */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      tms570_serialout(priv, TMS570_SCI_SETINT_OFFSET, SCI_INT_RX);
#endif
    }
  else
    {
      tms570_serialout(priv, TMS570_SCI_CLEARINT_OFFSET, SCI_INT_RX);
    }
}

/****************************************************************************
 * Name: tms570_rxavailable
 *
 * Description:
 *   Return true if the receive holding register is not empty
 *
 ****************************************************************************/

static bool tms570_rxavailable(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  return ((tms570_serialin(priv, TMS570_SCI_FLR_OFFSET) & \
          SCI_FLR_RXRDY) != 0);
}

/****************************************************************************
 * Name: tms570_send
 *
 * Description:
 *   This method will send one byte on the SCI
 *-
 ****************************************************************************/

static void tms570_send(struct uart_dev_s *dev, int ch)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  tms570_serialout(priv, TMS570_SCI_TD_OFFSET, (uint32_t)ch);
}

/****************************************************************************
 * Name: tms570_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void tms570_txint(struct uart_dev_s *dev, bool enable)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  irqstate_t flags;

  flags = enter_critical_section();
  if (enable)
    {
      /* Set to receive an interrupt when the TX holding register register
       * is empty
       */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      tms570_serialout(priv, TMS570_SCI_SETINT_OFFSET, SCI_INT_TX);

      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
#endif
    }
  else
    {
      /* Disable the TX interrupt */

      tms570_serialout(priv, TMS570_SCI_CLEARINT_OFFSET, SCI_INT_TX);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: tms570_txready
 *
 * Description:
 *   Return true if the transmit holding register is empty (TXRDY)
 *
 ****************************************************************************/

static bool tms570_txready(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  return ((tms570_serialin(priv, TMS570_SCI_FLR_OFFSET) & \
          SCI_FLR_TXRDY) != 0);
}

/****************************************************************************
 * Name: tms570_txempty
 *
 * Description:
 *   Return true if the transmit holding and shift registers are empty
 *
 ****************************************************************************/

static bool tms570_txempty(struct uart_dev_s *dev)
{
  struct tms570_dev_s *priv = (struct tms570_dev_s *)dev->priv;
  return ((tms570_serialin(priv, TMS570_SCI_FLR_OFFSET) & \
          SCI_FLR_TXEMPTY) != 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.
 *
 ****************************************************************************/

void arm_serialinit(void)
{
  /* Disable all SCIS */

  tms570_disableallints(TTYS0_DEV.priv, NULL);
#ifdef TTYS1_DEV
  tms570_disableallints(TTYS1_DEV.priv, NULL);
#endif

#ifdef CONSOLE_DEV
  /* Configure whichever one is the console.  NOTE: This was already done
   * in tms570_lowsetup().
   */

  CONSOLE_DEV.isconsole = true;
  tms570_setup(&CONSOLE_DEV);

  /* Register the console */

  uart_register("/dev/console", &CONSOLE_DEV);
#endif

  /* Register all SCIs */

  uart_register("/dev/ttyS0", &TTYS0_DEV);
#ifdef TTYS1_DEV
  uart_register("/dev/ttyS1", &TTYS1_DEV);
#endif
}

#endif /* USE_SERIALDRIVER */
